app/Controllers/Voluntario/VoluntarioController.php

SELECT *
FROM `Mensaje`
WHERE `Remitente` = '31'
SELECT *
FROM `Mensaje`
WHERE `Destinatario` = '31'
---
    public function voluntario_mensajes()
    {
        $sesionID = session()->get('loggedUser.userId');
        $mensajeE = new MensajeModel();
        $mensaje = new MensajeModel();

        $data['mensajesenviados'] = $mensaje->where('Remitente', $sesionID)->findAll();
        $data['mensajesrecibidos'] = $mensajeE->where('Destinatario', $sesionID)->findAll();