app/Controllers/Voluntario/VoluntarioController.php

SELECT *
FROM `Voluntario`
WHERE `IDusuario` = '30'
 LIMIT 1
---
    public function dashboard()
    {
        $sesionID = session()->get('loggedUser.userId');

        $voluntario = new VoluntarioModel();
        $userVol = $voluntario->where('IDusuario', $sesionID)->first();

SELECT *
FROM `Voluntario`
WHERE `IDusuario` = '30'
 LIMIT 1
SELECT *
FROM `Postulaciones`
WHERE `EstadoPostulacion` = 'Aceptada'
AND `IDvoluntario` = '4'
SELECT *
FROM `Postulaciones`
SELECT *
FROM `Donacion`
SELECT *
FROM `Producto`
SELECT *
FROM `Alimento`
---
    public function voluntario_coordinacion()
    {
        $sesionID = session()->get('loggedUser.userId');
        $voluntario = new VoluntarioModel();
        $userVol = $voluntario->where('IDusuario', $sesionID)->first();
        $IDvol = $userVol['IDVoluntario'];

        $data['Vol'] = $userVol;

        $postulacionesModel = new PostulacionModel();
        $data['postulaciones'] = $postulacionesModel->where('EstadoPostulacion', 'Aceptada')->where('IDvoluntario', $IDvol)->findAll();

        $postulacionesModel = new PostulacionModel();
        $data['postulacioness'] = $postulacionesModel->findAll();

        $solicitudModel = new SolicitudModel();
        $data['solicitudes_aceptada'] = $solicitudModel
            ->where('EstadoSolicitud', 'Aceptada')
            ->findAll();

        $donaciones = new DonacionModel();
        $data['donaciones'] = $donaciones->findAll();

        $productos = new ProductoModel();
        $data['productos'] = $productos->findAll();

        $alimentos = new AlimentoModel();
        $data['alimentos'] = $alimentos->findAll();