app/Controllers/Auth/AuthController.php

    public function login()
    {
        // Validar los datos del formulario de inicio de sesión
        $validation = $this->validate([
            'username' => 'required',
            'password' => 'required',
        ]);

        if (!$validation) {
            // Si la validación falla, redirigir de vuelta al formulario con los errores
            return redirect()->back()->withInput()->with('errors', ['Por favor, completa todos los campos']);
        }

        // Obtener los datos del formulario
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Verificar si el usuario existe
        $userModel = new UsuarioModel();
        $user = $userModel->where('usuario', $username)->first();
---
SELECT *
FROM `Usuario`
WHERE `usuario` = 'admin'
 LIMIT 1