app/Controllers/Admin/AdminController.php

    public function dashboard()
    {
        // Obtener datos estadísticos para el panel de administración
        $usuariosCount = model(UsuarioModel::class)->countAllResults();
        $donacionesCount = model(DonacionModel::class)->countAllResults();
        $solicitudesCount = model(SolicitudModel::class)->countAllResults();
        $postulacionesCount = model(PostulacionModel::class)->countAllResults();

        $usuarioModel = new UsuarioModel();
        $totalUsuarios = $usuarioModel->countAll(); // Obtener el total de usuarios registrados

        $donacionModel = new DonacionModel();
        $donacionesPendientes = $donacionModel->where('estado', 'pendiente')->countAllResults(); // Obtener el total de donaciones pendientes
---
SELECT COUNT(*) AS `numrows`
FROM `Usuario`
SELECT COUNT(*) AS `numrows`
FROM `Donacion`
SELECT COUNT(*) AS `numrows` FROM `Usuario`
SELECT COUNT(*) AS `numrows`
FROM `Donacion`
WHERE `estado` = 'pendiente'

    public function aceptar_donacion($id)
    {
        $donacionModel = new DonacionModel();
        $donacion = $donacionModel->find($id);
        if ($donacion) {
            $donacionModel->update($id, ['Estado' => 'Aceptada']);
---
UPDATE `Donacion` SET `Estado` = 'Aceptada'
WHERE `Donacion`.`IDDonacion` IN ('139')