app/Models/Donante/DonacionModel.php

SELECT *
FROM `Donacion`
---
    public function getDonacion()
    {
        return $this->findAll();

SELECT *
FROM `Donacion`
WHERE `EstadoDonacion` = 'Cancelada'
---
    public function getDonacionCancelada()
    {

        return $this->where('EstadoDonacion', 'Cancelada')->findAll();

SELECT *
FROM `Donacion`
WHERE `EstadoDonacion` = 'Pendiente'
---
    public function getDonacionPendiente()
    {

        return $this->where('EstadoDonacion', 'Pendiente')->findAll();

SELECT *
FROM `Donacion`
WHERE `EstadoDonacion` = 'Entregada'
---
    public function getDonacionEntregada()
    {

        return $this->where('EstadoDonacion', 'Entregada')->findAll();