app/Controllers/Donante/DonanteController.php

    public function addproal ($idDon){

        $sesionID = session()->get('loggedUser.userId');
        $donanteModel = new DonanteModel();
        $donante = $donanteModel->where('IDusuario', $sesionID)->first();
        $IDdonante = $donante['IDDonante'];

        $donacionModel = new DonacionModel();
        $data['donacion'] = $donacionModel -> where('IDDonacion', $idDon)->first();
        $solicitud = new SolicitudModel();
        $data['solicitud'] = $solicitud -> where('IDSolicitud', $data['donacion']['IDSolicitud'])->first();
        $alimentoModel = new AlimentoModel();
        $data['alimentos'] = $alimentoModel -> where('IDDonacion', $idDon)->findAll();
        $productoModel = new ProductoModel();
        $data['productos'] = $productoModel -> where('IDDonacion', $idDon)->findAll();
---
SELECT *
FROM `Donante`
WHERE `IDusuario` = '10'
 LIMIT 1
SELECT *
FROM `Donacion`
WHERE `IDDonacion` = '137'
 LIMIT 1
SELECT *
FROM `Alimento`
WHERE `IDDonacion` = '137'
SELECT *
FROM `Producto`
WHERE `IDDonacion` = '137'