app/Models/UsuarioModel.php

SELECT *
FROM `Usuario`
---
    public function getusuarios()
    {
        return $this->findAll();